Tekla Open API Reference for Tekla Structures 2025
LineTypeAttributes Constructor (LineTypes, TeklaDrawingColor)
 Creates a new line type attributes instance with the given line type and color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes(
	LineTypes lineType,
	TeklaDrawingColor color
)
Public Sub New (
	lineType As LineTypes,
	color As TeklaDrawingColor
)
Parameters
lineType
Type: Tekla.Structures.Drawing.LineTypes
The line type to be used.
color
Type: Tekla.Structures.Drawing.TeklaDrawingColor
The color to be used.
See Also
Reference
LineTypeAttributes Class
LineTypeAttributes Overload
Tekla.Structures.Drawing Namespace